<style scoped></style>

<template>
    <main class="dashboard_body flex flex-col gap-4 md:p-4 md:py-1">
        <div class="flex p-4 w-8/12 rounded-3xl bg-gray-900 shadow-lg">
            <div class="orange_gradient_h w-96 h-96 rounded-3xl shadow-xl"></div>
        </div>
        <!-- TODO : add permission for every group section of dashboard -->
        <ul class="flex flex-col gap-2">
            <strong>آمار ها</strong>
            <li>درآمد کل - به همراه میزان این ماه و میزان تفاوت با ماه قبل</li>
            <li>تعداد دانشجویان - به همراه میزان این ماه و میزان تفاوت با ماه قبل</li>
            <li>تعداد دانشجویانی که خرید کرده اند - به همراه میزان این ماه و میزان تفاوت با ماه قبل</li>
            <li>تعداد کل دروس - به همراه میزان این ماه و میزان تفاوت با ماه قبل</li>
            <li>تعداد خرید ها - به همراه میزان این ماه و میزان تفاوت با ماه قبل</li>

            <hr class="w-full" />

            <li>دوره های پر فروش - با نمایش میزان فروش</li>
            <li>دوره های پر بازدید - با نمایش تعداد بازدید</li>

            <hr class="w-full" />

            <li>میزان درآمد به تفکیک یک روز معلوم - ماه (روز های یک ماه) - سال (ماه های یک سال)</li>
            <li>میزان ثبت نامی ها به تفکیک یک روز معلوم - ماه (روز های یک ماه) - سال (ماه های یک سال)</li>

            <hr class="w-full" />

            <li>میزان رجوع روزانه با توجه به سشن لاگین کاربر ها</li>
            <li>میزان کاربران آنلاین با توجه به سشن لاگین کاربر ها</li>
            <li>تفکیک کاربران بر اساس user-agent</li>

            <hr class="w-full" />

            <li>تعداد ویزیت ها با لینک یک بازاریاب به تفکیک یک روز معلوم - ماه (روز های یک ماه) - سال (ماه های یک سال)</li>
            <li>تعداد ثبت نامی های هر بازاریاب به تفکیک یک روز معلوم - ماه (روز های یک ماه) - سال (ماه های یک سال)</li>
            <li>تعداد کاربرانی که در بازه اولیه هر بازاریاب هستند</li>

            <hr class="w-full" />

            <strong>ویجت ها</strong>
            <li>نظرات کاربران</li>
            <li>تراکنش های اخیر به تفکیک نوع محصول</li>
            <li>پیام های ارسالی از تماس با ما و همکاری با ما</li>
        </ul>
    </main>
</template>

<script>
export default {
    layout: "admin",
};
</script>
